{
  "access": "Authenticated",
  "components": [
    {
      "components": [
        {
          "name": "pageTitle",
          "size": "H1",
          "text": "Home",
          "type": "heading"
        },
        {
          "content": "<p><b>Welcome to the Hazard Management System (HMS) for the HeroX NASA Mars XR Hackathon.</b><br><br>The sustainable exploration of Mars will require autonomous and operational flexibility [1] via countermeasures that support shifting levels of autonomy for earth independent exploration missions [2]. Navigation tools can assist with increasing autonomy during EVA operations. Our proposed Hazard Management System (HMS) seeks to address this by providing crews on Mars with real-time anomalous and hazard identification during navigation to assist with safe and effective execution of exploration EVAs. HMS is a web assembly database management system application that includes a website portal and mobile application (Android and Apple) for business end-users to sign-in and login to easily manage data that is needed for end-users within the UE5 XR application. The data will be stored within two databases (SQL and SQLite) and is pushed to an interactive dashboard system that end-users can consult with while using the XR UE5 application. Without the real-time support of Mission Control on Earth, HMS is meant to assist crew members with data analytics for complex operations during EVAs for real-time exploration.<br><br>\n[1] Abercromby, Andrew. (2022). Mars Walking: Enabling Crew Health and Performance During Spacewalks on the Red Planet. Rice Space Institute. Houston, TX.<br>\n[2] Moon to Mars Overview. NASA. Retried May 26, 2022, from <a href=\"https://www.nasa.gov/topics/moon-to-mars/overview\">https://www.nasa.gov/topics/moon-to-mars/overview</a><br>\n[3]MEDA. Accessed July 23, 2022 from <a href=\"https://mars.nasa.gov/mars2020/spacecraft/instruments/meda/\">https://mars.nasa.gov/mars2020/spacecraft/instruments/meda/</a><br>\n[4] Attachment J-02 XEVAS SYSTEM REQUIREMENTS DOCUMENT (SRD). National Aeronautics and Space Administration. NASA. Retrieved June 6, 2022, from <a href=\"https://www.nasa.gov/jsc/procurement/xevas\">https://www.nasa.gov/jsc/procurement/xevas</a><br>\n[5]SuperCam. Accessed July 22, 2022 from <a href=\"https://mars.nasa.gov/mars2020/spacecraft/instruments/supercam/\">https://mars.nasa.gov/mars2020/spacecraft/instruments/supercam/</a></p>",
          "name": "html0",
          "type": "html"
        }
      ],
      "container": "main",
      "type": "content"
    }
  ],
  "layout": "Main",
  "name": "Home"
}